Revit 2027 API
StructuralConnectionHandlerType.UpdateCustomConnectionType Method
 Modifies StructuralConnectionHandlerType of input StructuralConnectionHandler. Adds input elements or subelements. Removes input subelements.The subelements will be erased. Updates any geometrical, parametrical or location changes of existing subelements, regardless of whether elements or subelements are added or removed.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static void UpdateCustomConnectionType(
	StructuralConnectionHandler structuralConnectionHandler,
	IList<Reference> addReferences,
	IList<Reference> removeReferences
)
Public Shared Sub UpdateCustomConnectionType (
	structuralConnectionHandler As StructuralConnectionHandler,
	addReferences As IList(Of Reference),
	removeReferences As IList(Of Reference)
)
public:
static void UpdateCustomConnectionType(
	StructuralConnectionHandler^ structuralConnectionHandler,
	IList<Reference^>^ addReferences,
	IList<Reference^>^ removeReferences
)
static member UpdateCustomConnectionType :
        structuralConnectionHandler : StructuralConnectionHandler *
        addReferences : IList<Reference> *
        removeReferences : IList<Reference> -> unit
Parameters
structuralConnectionHandler StructuralConnectionHandler
 The existing StructuralConnectionHandler having custom StructuralConnectionHandlerType which is about to be modified.
addReferences IList<Reference>
 References to elements or subelements which are to be used to modify custom StructuralConnectionHandlerType by adding them.
removeReferences IList<Reference>
 References to subelements of input StructuralConnectionHandler which are to be used to modify custom StructuralConnectionHandlerType by removing them.
Exceptions
Exception | Condition
ArgumentException |  Input StructuralConnectionHandler must have custom type. -or- All the input Elements should be of the following structural categories: framings, columns, profiles, plates, bolts, anchors, shear studs, welds or structural connections. -or- Total number of different input elements of input StructuralConnectionHandlers must be lower or equal to 3. -or- All the input references must belong to input StructuralConnectionHandler. After modification of StructuralConnectionHandlerType there must remain at least one subelement of structural connections category in StructuralConnectionHandler.
ArgumentNullException |  A non-optional argument was null
Remarks
 Elements or subelements added to a custom connection are deleted and transformed in subelements of the connection. They could be:
FamilyInstance (structural beams and columns).
StructuralConnectionHandler elements associated to the connection.
Specific steel connection elements (bolts, anchors, plates, etc). These connection elements will be of type element but with categories related to structural connections, for example:
OST_StructConnectionWelds
OST_StructConnectionHoles
OST_StructConnectionModifiers
OST_StructConnectionShearStuds
OST_StructConnectionBolts
OST_StructConnectionAnchors
OST_StructConnectionPlates
 You cannot add: elements connected by any connection handler, generic connections, holes and modifiers that are not on the connected elements.
See Also
Reference
StructuralConnectionHandlerType Class
Autodesk.Revit.DB.Structure Namespace